araobp/stm32-mcu/NUCLEO-F401RE/AI/AI_PERFORMANCE/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
/**
 ******************************************************************************
 * @file    aiSystemPerformance.c
 * @author  MCD Vertical Application Team
 * @brief   Entry points for AI system performance application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) YYYY STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */

/*
 * Description:
 *
 * - Simple STM32 application to measure and report the system performance of
 *   a generated NN
 * - STM32CubeMX.AI tools version: Client API "1.0" / AI Platform 3.2.x
 * - Only STM32F7, STM32F4 or STM32L4 MCU-base family are supported
 * - Random input values are injected in the NN to measure the inference time
 *   and to monitor the usage of the stack and/or the heap. Output value are
 *   skipped.
 * - After N iterations (_APP_ITER_ C-define), results are reported through a
 *   re-target printf
 * - aiSystemPerformanceInit()/aiSystemPerformanceProcess() functions should
 *   be called from the main application code.
 * - Only UART (to re-target the printf) & CORE clock setting are expected
 *   by the initial run-time (main function).
 *   CRC IP should be also enabled for AI Platform >= 3.0.0
 *
 * Atollic/AC6 IDE (GCC-base toolchain)
 *  - Linker options "-Wl,--wrap=malloc -Wl,--wrap=free" should be used
 *    to support the HEAP monitoring
 *
 * TODO:
 *  - complete the returned HEAP data
 *  - add HEAP monitoring for IAR tool-chain
 *  - add HEAP/STACK monitoring MDK-ARM Keil tool-chain
 *
 * History:
 *  - v1.0 - Initial version
 *  - v1.1 - Complete minimal interactive console
 *  - v1.2 - Adding STM32H7 MCU support
 *  - v1.3 - Adding STM32F3 MCU support
 *  - v1.4 - Adding Profiling mode
 *  - v2.0 - Adding Multiple Network support
 *  - v2.1 - Adding F3 str description
 */

/* System headers */
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>
#include <inttypes.h>
#include <string.h>

#if defined(__GNUC__)
#include <errno.h>
#include <sys/unistd.h> /* STDOUT_FILENO, STDERR_FILENO */
#elif defined (__ICCARM__)
#if (__IAR_SYSTEMS_ICC__ <= 8) 
/* Temporary workaround - LowLevelIOInterface.h seems not available
 with IAR 7.80.4 */
#define _LLIO_STDIN  0
#define _LLIO_STDOUT 1
#define _LLIO_STDERR 2
#define _LLIO_ERROR ((size_t)-1) /* For __read and __write. */
#else
#include <LowLevelIOInterface.h> /* _LLIO_STDOUT, _LLIO_STDERR */
#endif

#elif defined (__CC_ARM)

#endif

#include <aiSystemPerformance.h>
#include <bsp_ai.h>

/* APP configuration 0: disabled 1: enabled */
#define _APP_DEBUG_         0
#if defined(__GNUC__)
#define _APP_STACK_MONITOR_ 1
#define _APP_HEAP_MONITOR_  1
#elif defined (__ICCARM__)
#define _APP_STACK_MONITOR_ 1
#define _APP_HEAP_MONITOR_  0   /* not yet supported */
#else
#define _APP_STACK_MONITOR_ 0   /* not yet supported */
#define _APP_HEAP_MONITOR_  0   /* not yet supported */
#endif

extern UART_HandleTypeDef UartHandle;

/* AI header files */
#include "ai_platform.h"

#if !defined(STM32F7) && !defined(STM32L4) && !defined(STM32F4) && !defined(STM32H7) && !defined(STM32F3)
#error Only STM32H7, STM32F7, STM32F4, STM32L4 or STM32F3 device are supported
#endif

#define _APP_VERSION_MAJOR_     (0x02)
#define _APP_VERSION_MINOR_     (0x01)
#define _APP_VERSION_   ((_APP_VERSION_MAJOR_ << 8) | _APP_VERSION_MINOR_)

#define _APP_NAME_      "AI system performance measurement"

#define _APP_ITER_       16  /* number of iteration for perf. test */

struct dwtTime {
	uint32_t fcpu;
	int s;
	int ms;
	int us;
};

/* -----------------------------------------------------------------------------
 * Device-related functions
 * -----------------------------------------------------------------------------
 */

__STATIC_INLINE void crcIpInit(void) {
#if defined(STM32H7)
	/* By default the CRC IP clock is enabled */
	__HAL_RCC_CRC_CLK_ENABLE();
#else
	if (!__HAL_RCC_CRC_IS_CLK_ENABLED())
		printf("W: CRC IP clock is NOT enabled\r\n");

	/* By default the CRC IP clock is enabled */
	__HAL_RCC_CRC_CLK_ENABLE()
	;
#endif
}

__STATIC_INLINE void dwtIpInit(void) {
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

#ifdef STM32F7
	DWT->LAR = 0xC5ACCE55;
#endif

	DWT->CYCCNT = 0;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk | DWT_CTRL_CPIEVTENA_Msk;
}

__STATIC_INLINE void dwtReset(void) {
	DWT->CYCCNT = 0; /* Clear DWT cycle counter */
}

__STATIC_INLINE uint32_t dwtGetCycles(void) {
	return DWT->CYCCNT;
}

__STATIC_INLINE uint32_t systemCoreClock(void) {
#if !defined(STM32H7) 
	return HAL_RCC_GetHCLKFreq();
#else
	return HAL_RCC_GetSysClockFreq();
#endif
}

__STATIC_INLINE int dwtCyclesToTime(uint64_t clks, struct dwtTime *t) {
	if (!t)
		return -1;
	uint32_t fcpu = systemCoreClock();
	uint64_t s = clks / fcpu;
	uint64_t ms = (clks * 1000) / fcpu;
	uint64_t us = (clks * 1000 * 1000) / fcpu;
	ms -= (s * 1000);
	us -= (ms * 1000 + s * 1000000);
	t->fcpu = fcpu;
	t->s = s;
	t->ms = ms;
	t->us = us;
	return 0;
}

__STATIC_INLINE const char *devIdToStr(uint16_t dev_id) {
	const char *str;
	switch (dev_id) {
	case 0x422:
		str = "STM32F303xB/C";
		break;
	case 0x438:
		str = "STM32F303x6/8";
		break;
	case 0x446:
		str = "STM32F303xD/E";
		break;
	case 0x431:
		str = "STM32F411xC/E";
		break;
	case 0x435:
		str = "STM32L43xxx";
		break;
	case 0x462:
		str = "STM32L45xxx";
		break;
	case 0x415:
		str = "STM32L4x6xx";
		break;
	case 0x470:
		str = "STM32L4Rxxx";
		break;
	case 0x449:
		str = "STM32F74xxx";
		break;
	case 0x450:
		str = "STM32H743/753 and STM32H750";
		break;
	default:
		str = "UNKNOWN";
	}
	return str;
}

#if !defined(STM32F3)
__STATIC_INLINE const char* bitToStr(uint32_t val) {
	if (val)
		return "True";
	else
		return "False";
}
#endif

