araobp/stm32-mcu/NUCLEO-F401RE/AI/AI_PERFORMANCE/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
__STATIC_INLINE void logDeviceConf(void) {
	uint32_t acr = FLASH->ACR;
	uint32_t val;

	printf("STM32 Runtime configuration...\r\n");

	printf(" Device       : DevID:0x%08x (%s) RevID:0x%08x\r\n",
			(int) HAL_GetDEVID(), devIdToStr(HAL_GetDEVID()),
			(int) HAL_GetREVID());

	printf(" Core Arch.   : M%d - %s %s\r\n",
	__CORTEX_M,
#if (__FPU_PRESENT == 1)
			"FPU PRESENT",
			__FPU_USED ? "and used" : "and not used!"
#else
							"!FPU NOT PRESENT",
							""
#endif
)	;

	printf(" HAL version  : 0x%08x\r\n", (int) HAL_GetHalVersion());

	val = systemCoreClock() / 1000000;

#if !defined(STM32H7)
	printf(" system clock : %u MHz\r\n", (int) val);
#else
	printf(" SYSCLK clock : %u MHz\r\n", (int)val);
	printf(" HCLK clock   : %u MHz\r\n", (int)HAL_RCC_GetHCLKFreq()/1000000);
#endif

#if defined(STM32F7) || defined(STM32H7)
	val = SCB->CCR;
#if !defined(STM32H7)
	printf(" FLASH conf.  : ACR=0x%08x - Prefetch=%s ART=%s latency=%d\r\n",
			(int)acr,
			bitToStr((acr & FLASH_ACR_PRFTEN_Msk) >> FLASH_ACR_PRFTEN_Pos),
			bitToStr((acr & FLASH_ACR_ARTEN_Msk) >> FLASH_ACR_ARTEN_Pos),
			(int)((acr & FLASH_ACR_LATENCY_Msk) >> FLASH_ACR_LATENCY_Pos));
#else
	printf(" FLASH conf.  : ACR=0x%08x - latency=%d\r\n",
			(int)acr,
			(int)((acr & FLASH_ACR_LATENCY_Msk) >> FLASH_ACR_LATENCY_Pos));
#endif
	printf(" CACHE conf.  : $I/$D=(%s,%s)\r\n",
			bitToStr(val & SCB_CCR_IC_Msk),
			bitToStr(val & SCB_CCR_DC_Msk));
#else
#if !defined(STM32F3)
	printf(
			" FLASH conf.  : ACR=0x%08x - Prefetch=%s $I/$D=(%s,%s) latency=%d\r\n",
			(int) acr,
			bitToStr((acr & FLASH_ACR_PRFTEN_Msk) >> FLASH_ACR_PRFTEN_Pos),
			bitToStr((acr & FLASH_ACR_ICEN_Msk) >> FLASH_ACR_ICEN_Pos),
			bitToStr((acr & FLASH_ACR_DCEN_Msk) >> FLASH_ACR_DCEN_Pos),
			(int) ((acr & FLASH_ACR_LATENCY_Msk) >> FLASH_ACR_LATENCY_Pos));
#endif
#endif
}

__STATIC_INLINE uint32_t disableInts(void) {
	uint32_t state;

	state = __get_PRIMASK();
	__disable_irq();

	return state;
}

__STATIC_INLINE void restoreInts(uint32_t state) {
	__set_PRIMASK(state);
}

/* -----------------------------------------------------------------------------
 * low-level I/O functions
 * -----------------------------------------------------------------------------
 */

static struct ia_malloc {
	uint32_t cfg;
	uint32_t alloc;
	uint32_t free;
	uint32_t alloc_req;
	uint32_t free_req;
} ia_malloc;

#define MAGIC_MALLOC_NUMBER 0xefdcba98

static int ioGetUint8(uint8_t *buff, int count, uint32_t timeout) {
	HAL_StatusTypeDef status;

	if ((!buff) || (count <= 0))
		return -1;

	status = HAL_UART_Receive(&UartHandle, (uint8_t *) buff, count, timeout);

	if (status == HAL_TIMEOUT)
		return -1;

	return (status == HAL_OK ? count : 0);
}

#if defined(__GNUC__)

int _write(int fd, const void *buff, int count);

int _write(int fd, const void *buff, int count) {
	HAL_StatusTypeDef status;

	if ((count < 0) && (fd != STDOUT_FILENO) && (fd != STDERR_FILENO)) {
		errno = EBADF;
		return -1;
	}

	status = HAL_UART_Transmit(&UartHandle, (uint8_t *) buff, count,
	HAL_MAX_DELAY);

	return (status == HAL_OK ? count : 0);
}

void* __real_malloc(size_t bytes);
void __real_free(void *ptr);

void* __wrap_malloc(size_t bytes) {
	uint8_t *ptr;

	ia_malloc.cfg |= 1 << 1;

	/* ensure alignment for magic number */
	bytes = (bytes + 3) & ~3;

	/* add 2x32-bit for size and magic  number */
	ptr = (uint8_t*) __real_malloc(bytes + 8);

	/* remember size */
	if (ptr) {
		*((uint32_t*) ptr) = bytes;
		*((uint32_t*) (ptr + 4 + bytes)) = MAGIC_MALLOC_NUMBER;
	}

	if ((ptr) && (ia_malloc.cfg & 1UL)) {
		ia_malloc.alloc_req++;
		ia_malloc.alloc += bytes;
	}
	return ptr ? (ptr + 4) : NULL;
}

void __wrap_free(void *ptr) {
	uint8_t* p;
	uint32_t bytes;

	ia_malloc.cfg |= 1 << 2;

	if (!ptr)
		return;

	p = (uint8_t*) ptr - 4;
	bytes = *((uint32_t*) p);

	if (*((uint32_t*) (p + 4 + bytes)) == MAGIC_MALLOC_NUMBER) {
		*((uint32_t*) (p + 4 + bytes)) = 0;
	}

	if (ia_malloc.cfg & 1UL) {
		ia_malloc.free_req++;
		ia_malloc.free += bytes;
	}
	__real_free(p);
}

#elif defined (__ICCARM__)

__ATTRIBUTES size_t __write(int handle, const unsigned char *buffer,
		size_t size);

__ATTRIBUTES size_t __write(int handle, const unsigned char *buffer,
		size_t size)
{
	HAL_StatusTypeDef status;

	/*
	 * This means that we should flush internal buffers.  Since we
	 * don't we just return.  (Remember, "handle" == -1 means that all
	 * handles should be flushed.)
	 */
	if (buffer == 0)
	return 0;

	/* This template only writes to "standard out" and "standard err",
	 * for all other file handles it returns failure.
	 */
	if ((handle != _LLIO_STDOUT) && (handle != _LLIO_STDERR))
	return _LLIO_ERROR;

	status = HAL_UART_Transmit(&UartHandle, (uint8_t *)buffer, size,
			HAL_MAX_DELAY);

	return (status == HAL_OK ? size : _LLIO_ERROR);
}

#if _APP_HEAP_MONITOR_ == 1
#undef _APP_HEAP_MONITOR_
#define _APP_HEAP_MONITOR_ 0
#warning HEAP monitor is not YET supported
#endif

#elif defined (__CC_ARM)

int fputc(int ch, FILE *f)
{
	HAL_UART_Transmit(&UartHandle, (uint8_t *)&ch, 1,
			HAL_MAX_DELAY);
	return ch;
}

#if _APP_STACK_MONITOR_ == 1
#undef _APP_STACK_MONITOR_
#define _APP_STACK_MONITOR_ 0
#warning STACK monitor is not YET supported
#endif

#if _APP_HEAP_MONITOR_ == 1
#undef _APP_HEAP_MONITOR_
#define _APP_HEAP_MONITOR_ 0
#warning HEAP monitor is not YET supported
#endif

#else
#error ARM MCU tool-chain is not supported.
#endif

/* -----------------------------------------------------------------------------
 * AI-related functions
 * -----------------------------------------------------------------------------
 */

struct network_exec_ctx {
	ai_handle handle;
	ai_network_report report;
} net_ctx[AI_MNETWORK_NUMBER] = { 0 };

#define AI_BUFFER_NULL(ptr_)  \
  AI_BUFFER_OBJ_INIT( \
    AI_BUFFER_FORMAT_NONE|AI_BUFFER_FMT_FLAG_CONST, \
    0, 0, 0, 0, \
    AI_HANDLE_PTR(ptr_))

AI_ALIGNED(4)
static ai_u8 activations[AI_MNETWORK_DATA_ACTIVATIONS_SIZE];

static ai_float in_data[AI_MNETWORK_IN_1_SIZE] = { 17.8, 17.8, 17.8, 17.8, 17.7,
		17.8, 17.8, 17.8, 17.8, 17.7, 17.7, 17.7, 17.6, 17.5, 17.4, 17.3, 17.2,
		17.2, 17.3, 17.5, 17.7, 18.0, 18.2, 18.3, 18.3, 18.2, 18.1, 18.0, 17.8,
		17.7, 17.5, 17.2, 17.9, 17.9, 18.0, 18.0, 18.0, 18.0, 18.0, 18.0, 18.0,
		18.0, 17.9, 17.8, 17.8, 17.7, 17.7, 17.6, 17.5, 17.5, 17.4, 17.5, 17.7,
		17.9, 18.1, 18.1, 18.1, 18.0, 18.1, 18.1, 18.0, 17.8, 17.6, 17.4, 17.9,
		18.0, 18.1, 18.2, 18.2, 18.2, 18.3, 18.3, 18.3, 18.3, 18.2, 18.0, 18.0,
		18.0, 18.0, 17.9, 17.9, 17.7, 17.7, 17.8, 17.8, 17.9, 18.1, 18.0, 18.0,
		18.1, 18.3, 18.2, 18.1, 18.0, 17.8, 17.6, 18.0, 18.1, 18.2, 18.3, 18.4,
		18.4, 18.4, 18.5, 18.6, 18.6, 18.6, 18.5, 18.4, 18.4, 18.5, 18.5, 18.4,
		18.2, 18.1, 18.2, 18.3, 18.2, 18.2, 18.1, 18.2, 18.3, 18.5, 18.4, 18.3,
		18.1, 17.9, 17.8, 18.0, 18.1, 18.2, 18.4, 18.5, 18.5, 18.6, 18.7, 18.8,
		18.9, 18.9, 19.0, 19.0, 19.1, 19.2, 19.2, 19.2, 19.1, 19.0, 18.9, 18.9,
		18.8, 18.7, 18.6, 18.6, 18.7, 18.7, 18.6, 18.5, 18.3, 18.1, 17.9, 18.0,
		18.1, 18.2, 18.4, 18.5, 18.5, 18.6, 18.8, 19.0, 19.1, 19.3, 19.5, 19.7,
		20.0, 20.3, 20.4, 20.4, 20.4, 20.3, 20.2, 20.1, 19.9, 19.6, 19.3, 19.1,
		19.0, 18.9, 18.7, 18.5, 18.3, 18.1, 18.1, 17.9, 18.1, 18.2, 18.4, 18.4,
		18.5, 18.6, 18.8, 19.0, 19.4, 19.7, 20.0, 20.5, 21.3, 21.7, 22.1, 22.2,
		22.2, 22.1, 22.0, 21.9, 21.4, 20.9, 20.2, 19.6, 19.3, 19.1, 18.8, 18.5,
		18.3, 18.2, 18.4, 17.9, 18.0, 18.2, 18.3, 18.4, 18.5, 18.7, 18.9, 19.2,
		19.7, 20.2, 20.8, 21.8, 22.8, 23.4, 23.8, 24.1, 24.2, 24.1, 24.1, 23.6,
		23.0, 22.4, 21.6, 20.5, 19.8, 19.4, 18.9, 18.5, 18.4, 18.5, 18.6, 17.9,
		18.1, 18.2, 18.3, 18.5, 18.7, 18.9, 19.2, 19.7, 20.3, 21.1, 22.1, 23.3,
		24.3, 25.0, 25.6, 25.9, 26.1, 26.1, 25.9, 25.4, 24.7, 23.9, 23.0, 21.8,
		20.7, 19.8, 19.2, 18.8, 18.7, 18.7, 18.9, 18.0, 18.2, 18.3, 18.5, 18.7,
		19.0, 19.4, 19.9, 20.5, 21.3, 22.3, 23.4, 24.6, 25.7, 26.5, 27.1, 27.5,
		27.7, 27.7, 27.4, 26.9, 26.2, 25.3, 24.3, 23.0, 21.7, 20.6, 19.8, 19.3,
		19.1, 19.0, 19.0, 18.2, 18.4, 18.6, 18.8, 19.1, 19.6, 20.1, 20.8, 21.6,
		22.7, 23.4, 24.6, 25.8, 26.8, 27.6, 28.1, 28.5, 28.7, 28.6, 28.3, 27.8,
		27.1, 26.5, 25.5, 24.1, 22.7, 21.5, 20.6, 19.8, 19.4, 19.2, 19.0, 18.5,
		18.7, 19.0, 19.3, 19.7, 20.3, 21.1, 21.9, 23.4, 24.5, 25.1, 25.7, 26.8,
		27.8, 28.4, 28.9, 29.2, 29.3, 29.1, 28.8, 28.4, 28.0, 27.6, 26.6, 25.2,
		23.9, 22.6, 21.5, 20.4, 19.7, 19.3, 19.0, 18.8, 19.2, 19.5, 20.0, 20.6,
		21.3, 22.2, 23.7, 25.2, 26.3, 26.9, 27.2, 27.7, 28.5, 29.0, 29.3, 29.4,
		29.4, 29.3, 29.1, 29.0, 28.9, 28.5, 27.5, 26.3, 25.0, 23.6, 22.3, 21.2,
		20.2, 19.5, 19.0, 19.2, 19.6, 20.2, 20.8, 21.5, 22.5, 23.9, 25.4, 26.7,
		27.8, 28.4, 28.7, 28.8, 29.0, 29.3, 29.4, 29.4, 29.4, 29.5, 29.6, 29.6,
		29.6, 29.2, 28.3, 27.2, 25.8, 24.4, 23.0, 21.8, 20.8, 19.8, 19.0, 19.5,
		20.2, 20.9, 21.7, 22.7, 23.6, 24.9, 26.3, 27.7, 28.7, 29.1, 29.2, 29.2,
		29.4, 29.6, 29.7, 29.7, 29.6, 29.7, 29.9, 30.1, 30.1, 29.6, 28.7, 27.5,
		26.2, 24.8, 23.5, 22.2, 21.1, 20.0, 19.1, 19.9, 20.8, 21.7, 22.8, 24.2,
		25.1, 25.7, 26.8, 28.1, 29.0, 29.2, 29.2, 29.3, 29.5, 29.7, 29.9, 29.9,
		29.8, 29.9, 30.2, 30.4, 30.3, 29.8, 28.8, 27.6, 26.4, 25.1, 23.8, 22.6,
		21.3, 20.2, 19.2, 20.3, 21.4, 22.7, 24.3, 25.8, 26.6, 27.0, 27.3, 28.3,
		29.0, 29.1, 29.2, 29.3, 29.5, 29.7, 29.9, 30.0, 30.0, 30.1, 30.4, 30.5,
		30.3, 29.8, 28.8, 27.7, 26.6, 25.3, 24.0, 22.7, 21.5, 20.3, 19.3, 20.8,
		22.3, 24.1, 25.8, 27.1, 28.0, 28.4, 28.5, 28.5, 29.0, 29.1, 29.2, 29.3,
		29.5, 29.6, 29.8, 30.0, 30.1, 30.3, 30.4, 30.4, 30.2, 29.7, 28.8, 27.7,
		26.5, 25.2, 23.9, 22.7, 21.6, 20.5, 19.4, 21.4, 23.2, 25.0, 26.7, 28.0,
		28.8, 29.1, 29.1, 29.0, 29.1, 29.2, 29.3, 29.4, 29.5, 29.6, 29.8, 30.0,
		30.1, 30.3, 30.4, 30.4, 30.2, 29.6, 28.7, 27.5, 26.2, 24.9, 23.6, 22.5,
		21.5, 20.5, 19.5, 22.1, 23.7, 25.3, 27.0, 28.4, 29.2, 29.3, 29.2, 29.2,
		29.2, 29.4, 29.5, 29.5, 29.6, 29.8, 29.9, 30.1, 30.2, 30.3, 30.5, 30.4,
		30.2, 29.6, 28.6, 27.3, 26.0, 24.5, 23.1, 22.2, 21.3, 20.4, 19.6, 22.8,
		24.3, 25.7, 27.1, 28.5, 29.2, 29.2, 29.4, 29.4, 29.4, 29.5, 29.7, 29.8,
		29.8, 29.9, 30.1, 30.2, 30.1, 30.2, 30.4, 30.5, 30.1, 29.5, 28.4, 27.2,
		25.6, 23.8, 22.5, 21.7, 21.1, 20.4, 19.7, 23.2, 24.8, 26.2, 27.4, 28.5,
		29.2, 29.5, 29.6, 29.6, 29.6, 29.6, 29.8, 30.0, 30.0, 30.1, 30.2, 30.2,
		30.1, 30.1, 30.2, 30.3, 30.0, 29.3, 28.2, 26.7, 24.8, 23.0, 21.7, 21.0,
		20.6, 20.2, 19.8, 23.5, 25.0, 26.4, 27.7, 28.6, 29.3, 29.7, 29.8, 29.8,
		29.7, 29.8, 29.9, 30.1, 30.2, 30.3, 30.2, 30.1, 30.0, 30.0, 30.0, 30.0,
		29.7, 29.0, 27.7, 25.9, 24.1, 22.4, 21.1, 20.4, 20.0, 19.9, 19.8, 23.4,
		25.1, 26.5, 27.8, 28.8, 29.5, 29.8, 29.9, 29.9, 29.9, 29.9, 30.1, 30.2,
		30.3, 30.3, 30.2, 30.1, 30.0, 30.0, 29.9, 29.8, 29.3, 28.4, 27.2, 25.5,
		23.6, 21.9, 20.7, 20.1, 19.9, 19.8, 19.7, 23.1, 25.0, 26.6, 27.9, 29.0,
		29.7, 30.0, 30.2, 30.1, 30.0, 30.0, 30.1, 30.2, 30.3, 30.3, 30.2, 30.1,
		30.1, 29.9, 29.8, 29.5, 28.7, 27.6, 26.3, 25.0, 23.4, 21.6, 20.6, 20.1,
		20.0, 19.7, 19.7, 22.7, 24.6, 26.5, 27.9, 29.0, 29.8, 30.2, 30.3, 30.1,
		30.0, 30.1, 30.1, 30.2, 30.3, 30.3, 30.2, 30.2, 30.1, 29.8, 29.5, 28.8,
		27.8, 26.6, 25.4, 24.1, 22.9, 21.4, 20.5, 20.1, 19.8, 19.7, 19.7, 22.2,
		24.2, 26.1, 27.7, 29.0, 29.7, 30.1, 30.2, 30.1, 30.0, 30.0, 30.1, 30.2,
		30.3, 30.3, 30.3, 30.3, 30.0, 29.6, 28.9, 27.9, 26.8, 25.7, 24.5, 23.2,
		22.1, 21.2, 20.4, 20.0, 19.8, 19.7, 19.7, 21.9, 23.9, 25.8, 27.5, 28.7,
		29.6, 30.0, 30.1, 30.0, 30.0, 30.0, 30.1, 30.1, 30.2, 30.3, 30.2, 30.1,
		29.7, 29.1, 28.2, 27.2, 26.0, 24.8, 23.7, 22.6, 21.6, 20.7, 20.2, 19.8,
		19.7, 19.7, 19.8, 21.7, 23.7, 25.6, 27.2, 28.3, 29.2, 29.8, 30.0, 29.9,
		29.9, 30.0, 30.0, 30.1, 30.1, 30.1, 30.1, 29.9, 29.4, 28.7, 27.6, 26.6,
		25.3, 24.0, 22.9, 21.9, 21.1, 20.5, 20.1, 19.7, 19.6, 19.7, 19.8, 21.5,
		23.5, 25.2, 26.6, 27.8, 28.7, 29.4, 29.7, 29.8, 29.8, 29.9, 30.0, 30.0,
		30.0, 30.0, 29.9, 29.6, 29.2, 28.4, 27.1, 25.9, 24.6, 23.3, 22.3, 21.3,
		20.6, 20.3, 20.0, 19.8, 19.7, 19.7, 19.8, 21.4, 23.2, 24.7, 26.0, 27.2,
		28.1, 28.8, 29.3, 29.6, 29.7, 29.8, 29.9, 29.9, 29.9, 29.9, 29.7, 29.6,
		29.1, 28.2, 26.7, 25.2, 23.9, 22.7, 21.6, 20.8, 20.4, 20.1, 20.0, 19.9,
		19.8, 19.8, 19.9, 21.2, 22.8, 24.2, 25.5, 26.6, 27.5, 28.3, 28.9, 29.3,
		29.5, 29.6, 29.7, 29.7, 29.7, 29.7, 29.7, 29.4, 28.9, 27.9, 26.5, 24.9,
		23.3, 21.9, 21.0, 20.4, 20.1, 20.0, 20.0, 20.0, 20.0, 20.0, 20.0 };
static ai_float out_data[AI_MNETWORK_OUT_1_SIZE];

__STATIC_INLINE void aiLogErr(const ai_error err, const char *fct) {
	if (fct)
		printf("E: AI error (%s) - type=%d code=%d\r\n", fct, err.type,
				err.code);
	else
		printf("E: AI error - type=%d code=%d\r\n", err.type, err.code);
}

