araobp/stm32-mcu/NUCLEO-F401RE/AI/AI_PERFORMANCE/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
__STATIC_INLINE const char* aiBufferFormatToStr(uint32_t val) {
	if (val == AI_BUFFER_FORMAT_NONE)
		return "AI_BUFFER_FORMAT_NONE";
	else if (val == AI_BUFFER_FORMAT_FLOAT)
		return "AI_BUFFER_FORMAT_FLOAT";
	else if (val == AI_BUFFER_FORMAT_U8)
		return "AI_BUFFER_FORMAT_U8";
	else if (val == AI_BUFFER_FORMAT_Q15)
		return "AI_BUFFER_FORMAT_Q15";
	else if (val == AI_BUFFER_FORMAT_Q7)
		return "AI_BUFFER_FORMAT_Q7";
	else
		return "UNKNOWN";
}

__STATIC_INLINE ai_u32 aiBufferSize(const ai_buffer* buffer) {
	return buffer->height * buffer->width * buffer->channels;
}

__STATIC_INLINE void aiPrintLayoutBuffer(const char *msg,
		const ai_buffer* buffer) {
	printf("%s HWC layout:%d,%d,%ld (s:%ld f:%s)\r\n", msg, buffer->height,
			buffer->width, buffer->channels, aiBufferSize(buffer),
			aiBufferFormatToStr(buffer->format));
}

__STATIC_INLINE void aiPrintNetworkInfo(const ai_network_report* report) {
	printf("Network configuration...\r\n");
	printf(" Model name         : %s\r\n", report->model_name);
	printf(" Model signature    : %s\r\n", report->model_signature);
	printf(" Model datetime     : %s\r\n", report->model_datetime);
	printf(" Compile datetime   : %s\r\n", report->compile_datetime);
	printf(" Runtime revision   : %s (%d.%d.%d)\r\n", report->runtime_revision,
			report->runtime_version.major, report->runtime_version.minor,
			report->runtime_version.micro);
	printf(" Tool revision      : %s (%d.%d.%d)\r\n", report->tool_revision,
			report->tool_version.major, report->tool_version.minor,
			report->tool_version.micro);
	printf("Network info...\r\n");
	printf("  signature         : 0x%lx\r\n", report->signature);
	printf("  nodes             : %ld\r\n", report->n_nodes);
	printf("  complexity        : %ld MACC\r\n", report->n_macc);
	printf("  activation        : %ld bytes\r\n",
			aiBufferSize(&report->activations));
	printf("  weights           : %ld bytes\r\n",
			aiBufferSize(&report->weights));
	printf("  inputs/outputs    : %u/%u\r\n", report->n_inputs,
			report->n_outputs);
	aiPrintLayoutBuffer("  IN tensor format  :", &report->inputs);
	aiPrintLayoutBuffer("  OUT tensor format :", &report->outputs);
}

static int aiBootstrap(const char *nn_name, const int idx) {
	ai_error err;

	/* Creating the network */
	printf("Creating the network \"%s\"..\r\n", nn_name);
	err = ai_mnetwork_create(nn_name, &net_ctx[idx].handle, NULL);
	if (err.type) {
		aiLogErr(err, "ai_mnetwork_create");
		return -1;
	}

	/* Query the created network to get relevant info from it */
	if (ai_mnetwork_get_info(net_ctx[idx].handle, &net_ctx[idx].report)) {
		aiPrintNetworkInfo(&net_ctx[idx].report);
	} else {
		err = ai_mnetwork_get_error(net_ctx[idx].handle);
		aiLogErr(err, "ai_mnetwork_get_info");
		ai_mnetwork_destroy(net_ctx[idx].handle);
		net_ctx[idx].handle = AI_HANDLE_NULL;
		return -2;
	}

	/* Initialize the instance */
	printf("Initializing the network\r\n");
	/* build params structure to provide the reference of the
	 * activation and weight buffers */
	const ai_network_params params = {
	AI_BUFFER_NULL(NULL),
	AI_BUFFER_NULL(activations) };

	if (!ai_mnetwork_init(net_ctx[idx].handle, &params)) {
		err = ai_mnetwork_get_error(net_ctx[idx].handle);
		aiLogErr(err, "ai_mnetwork_init");
		ai_mnetwork_destroy(net_ctx[idx].handle);
		net_ctx[idx].handle = AI_HANDLE_NULL;
		return -4;
	}
	return 0;
}

static int aiInit(void) {
	const char *nn_name;
	int idx;

	float sum = 0.0f;
	float mean = 0.0f;
	float max_ = 0.0f;
	float min_ = 80.0f;
	float range_;
	for (int i = 0; i < AI_MNETWORK_IN_1_SIZE; i++) {
		sum += in_data[i];
		if (in_data[i] > max_)
			max_ = in_data[i];
		if (in_data[i] < min_)
			min_ = in_data[i];
	}
	mean = (max_ + min_) / 2.0;
	range_ = (max_ - min_) / 2.0;
	for (int i = 0; i < AI_MNETWORK_IN_1_SIZE; i++) {
		in_data[i] = (in_data[i] - mean) / range_;
	}

	printf("\r\nAI Network (AI platform API %d.%d.%d)...\r\n",
	AI_PLATFORM_API_MAJOR,
	AI_PLATFORM_API_MINOR,
	AI_PLATFORM_API_MICRO);

	/* Discover and init the embedded network */
	idx = 0;
	do {
		nn_name = ai_mnetwork_find(NULL, idx);
		if (nn_name) {
			printf("\r\nFound network \"%s\"\r\n", nn_name);
			if (aiBootstrap(nn_name, idx))
				return -1;
		}
		idx++;
	} while (nn_name);

	return 0;
}

static void aiDeInit(void) {
	ai_error err;
	int idx;

	printf("Releasing the network(s)...\r\n");

	for (idx = 0; idx < AI_MNETWORK_NUMBER; idx++) {
		if (net_ctx[idx].handle) {
			if (ai_mnetwork_destroy(net_ctx[idx].handle) != AI_HANDLE_NULL) {
				err = ai_mnetwork_get_error(net_ctx[idx].handle);
				aiLogErr(err, "ai_mnetwork_destroy");
			}
			net_ctx[idx].handle = NULL;
		}
	}
}

/* -----------------------------------------------------------------------------
 * Specific APP/test functions
 * -----------------------------------------------------------------------------
 */

#if defined(__GNUC__)
extern uint32_t _estack[];
#elif defined (__ICCARM__)
extern int CSTACK$$Limit;
extern int CSTACK$$Base;
#elif defined (__CC_ARM)
#if _APP_STACK_MONITOR_ == 1
#error STACK monitoring is not yet supported
#endif
#else
#error ARM MCU tool-chain is not supported.
#endif

static bool profiling_mode = false;
static int profiling_factor = 5;

#if defined(__GNUC__)
// #pragma GCC push_options
// #pragma GCC optimize ("O0")
#elif defined (__ICCARM__)
// #pragma optimize=none
#endif

static int aiTestPerformance(int idx) {
	int iter;
	uint32_t irqs;
	ai_i32 batch;
	int niter;

	struct dwtTime t;
	uint64_t tcumul;
	uint32_t tstart, tend;
	uint32_t tmin;
	uint32_t tmax;

	ai_buffer ai_input[1];
	ai_buffer ai_output[1];

#if _APP_STACK_MONITOR_ == 1
	uint32_t ctrl;
	bool stack_mon;
	uint32_t susage;

	uint32_t ustack_size; /* used stack before test */
	uint32_t estack; /* end of stack @ */
	uint32_t mstack_size; /* minimal master stack size */
	uint32_t cstack; /* current stack @ */
	uint32_t bstack; /* base stack @ */
#endif

	if (net_ctx[idx].handle == AI_HANDLE_NULL) {
		printf("E: network handle is NULL\r\n");
		return -1;
	}

#if _APP_STACK_MONITOR_ == 1
	/* Reading ARM Core registers */
	ctrl = __get_CONTROL();
	cstack = __get_MSP();

#if defined(__GNUC__)
	estack = (uint32_t) _estack;
	bstack = estack - MIN_STACK_SIZE;
	mstack_size = MIN_STACK_SIZE;
#elif defined (__ICCARM__)
	estack = (uint32_t)&CSTACK$$Limit;
	bstack = (uint32_t)&CSTACK$$Base;
	mstack_size = (uint32_t)&CSTACK$$Limit - (uint32_t)&CSTACK$$Base;
#endif

#endif

	if (profiling_mode)
		niter = _APP_ITER_ * profiling_factor;
	else
		niter = _APP_ITER_;

