araobp/stm32-mcu/NUCLEO-F401RE/AI/AI_PERFORMANCE/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
	printf(
			"\r\nRunning PerfTest on \"%s\" with random inputs (%d iterations)...\r\n",
			net_ctx[idx].report.model_name, niter);

#if _APP_STACK_MONITOR_ == 1
	/* Check that MSP is the active stack */
	if (ctrl & CONTROL_SPSEL_Msk) {
		printf(
				"E: MSP is not the active stack (stack monitoring is disabled)\r\n");
		stack_mon = false;
	} else
		stack_mon = true;

	/* Calculating used stack before test */
	ustack_size = estack - cstack;

	if ((stack_mon) && (ustack_size > mstack_size)) {
		printf("E: !stack overflow detected %ld > %ld\r\n", ustack_size,
				mstack_size);
		stack_mon = false;
	}
#endif

#if _APP_DEBUG_ == 1
	printf("D: stack before test (0x%08lx-0x%08lx %ld/%ld ctrl=0x%08lx\n",
			estack, cstack, ustack_size, mstack_size, ctrl);
#endif

	irqs = disableInts();

#if _APP_STACK_MONITOR_ == 1
	/* Fill the remaining part of the stack */
	if (stack_mon) {
		uint32_t *pw = (uint32_t*) ((bstack + 3) & (~3));

#if _APP_DEBUG_ == 1
		printf("D: fill stack 0x%08lx -> 0x%08lx (%ld)\n", pw, cstack,
				cstack - (uint32_t)pw);
#endif
		while ((uint32_t) pw < cstack) {
			*pw = 0xDEDEDEDE;
			pw++;
		}
	}
#endif

	/* reset/init cpu clock counters */
	tcumul = 0ULL;
	tmin = UINT32_MAX;
	tmax = 0UL;

	memset(&ia_malloc, 0, sizeof(struct ia_malloc));

	ai_input[0] = net_ctx[idx].report.inputs;
	ai_output[0] = net_ctx[idx].report.outputs;

	ai_input[0].n_batches = 1;
	ai_input[0].data = AI_HANDLE_PTR(in_data);
	ai_output[0].n_batches = 1;
	ai_output[0].data = AI_HANDLE_PTR(out_data);

	if (profiling_mode) {
		printf("Profiling mode (%d)...\r\n", profiling_factor);
		fflush(stdout);
	}

	for (iter = 0; iter < niter; iter++) {
		/* Fill input vector */

		//for (ai_size i = 0; i < aiBufferSize(&ai_input[0]); ++i) {
		//	/* uniform distribution between -1.0 and 1.0 */
		//	in_data[i] = 2.0f * (ai_float) rand() / (ai_float) RAND_MAX - 1.0f;
		//}
#if _APP_HEAP_MONITOR_ == 1
		ia_malloc.cfg |= 1UL;
#endif
		dwtReset();
		tstart = dwtGetCycles();

		batch = ai_mnetwork_run(net_ctx[idx].handle, &ai_input[0],
				&ai_output[0]);
		ai_float* output_ = (ai_float *) (ai_output[0].data);
		printf("Inference:[%d, %d, %d]\n", (int) (output_[0] * 100),
				(int) (output_[1] * 100), (int) (output_[2] * 100));
		if (batch != 1) {
			aiLogErr(ai_mnetwork_get_error(net_ctx[1].handle),
					"ai_mnetwork_run");
			break;
		}

		tend = dwtGetCycles() - tstart;

#if _APP_HEAP_MONITOR_ == 1
		ia_malloc.cfg &= ~1UL;
#endif

		if (tend < tmin)
			tmin = tend;

		if (tend > tmax)
			tmax = tend;

		tcumul += (uint64_t) tend;

#if _APP_DEBUG_ == 1
		dwtCyclesToTime(tend, &t);
		printf(" #%02d %8d.%03dms (%lu cycles)\r\n", iter,
				t.ms, t.us, tend);
#else
		if (!profiling_mode) {
			printf(".");
			fflush(stdout);
		}
#endif
	}

#if _APP_DEBUG_ != 1
	printf("\r\n");
#endif

#if _APP_STACK_MONITOR_ == 1
	if (__get_MSP() != cstack) {
		printf(
				"E: !current stack address is not coherent 0x%08lx instead 0x%08lx\r\n",
				__get_MSP(), cstack);
	}
#endif

#if _APP_STACK_MONITOR_ == 1
	/* Calculating the used stack */
	susage = 0UL;
	if (stack_mon) {
		uint32_t rstack = mstack_size - ustack_size;
		uint32_t *pr = (uint32_t*) ((bstack + 3) & (~3));
		bool overflow = false;

		/* check potential stack overflow with 8 last words*/
		for (int i = 0; i < 8; i++) {
			if (*pr != 0xDEDEDEDE)
				overflow = true;
			pr++;
		}

		if (!overflow) {
			susage = 8 * 4;
			while ((*pr == 0xDEDEDEDE) && ((uint32_t) pr < cstack)) {
				pr++;
				susage += 4;
			}
			susage = rstack - susage;
		} else {
			printf("E: !stack overflow detected > %ld\r\n", rstack);
		}
	}
#endif

	restoreInts(irqs);

	printf("\r\n");

	tcumul /= (uint64_t) iter;

	dwtCyclesToTime(tcumul, &t);

	printf(
			"Results for \"%s\", %d inferences @%ldMHz/%ldMHz (complexity: %lu MACC)\r\n",
			net_ctx[idx].report.model_name, iter,
			HAL_RCC_GetSysClockFreq() / 1000000,
			HAL_RCC_GetHCLKFreq() / 1000000, net_ctx[idx].report.n_macc);

	printf(" duration     : %d.%03d ms (average)\r\n", t.s * 1000 + t.ms, t.us);
	printf(" CPU cycles   : %lu -%lu/+%lu (average,-/+)\r\n",
			(uint32_t) (tcumul), (uint32_t) (tcumul - tmin),
			(uint32_t) (tmax - tcumul));
	printf(" CPU Workload : %d%c\r\n", (int) ((tcumul * 100) / t.fcpu), '%');
	printf(" cycles/MACC  : %lu (average for all layers)\n",
			(uint32_t) (tcumul / net_ctx[idx].report.n_macc));
#if _APP_STACK_MONITOR_ == 1
	if (stack_mon)
		printf(" used stack   : %ld bytes\r\n", susage);
	else
		printf(" used stack   : NOT CALCULATED\r\n");
#else
	printf(" used stack   : DISABLED\r\n");
#endif
#if _APP_HEAP_MONITOR_ == 1
	printf(
			" used heap    : %ld:%ld %ld:%ld (req:allocated,req:released) cfg=%ld\r\n",
			ia_malloc.alloc_req, ia_malloc.alloc, ia_malloc.free_req,
			ia_malloc.free, (ia_malloc.cfg & (3 << 1)) >> 1);
#else
	printf(" used heap    : DISABLED or NOT YET SUPPORTED\r\n");
#endif

	return 0;
}

#if defined(__GNUC__)
// #pragma GCC pop_options
#endif

#define CONS_EVT_TIMEOUT    (0)
#define CONS_EVT_QUIT       (1)
#define CONS_EVT_RESTART    (2)
#define CONS_EVT_HELP       (3)
#define CONS_EVT_PAUSE      (4)
#define CONS_EVT_PROF       (5)

#define CONS_EVT_UNDEFINED  (100)

static int aiTestConsole(void) {
	uint8_t c = 0;

	if (ioGetUint8(&c, 1, 5000) == -1) /* Timeout */
		return CONS_EVT_TIMEOUT;

	if ((c == 'q') || (c == 'Q'))
		return CONS_EVT_QUIT;

	if ((c == 'r') || (c == 'R'))
		return CONS_EVT_RESTART;

	if ((c == 'h') || (c == 'H') || (c == '?'))
		return CONS_EVT_HELP;

	if ((c == 'p') || (c == 'P'))
		return CONS_EVT_PAUSE;

	if ((c == 'x') || (c == 'X'))
		return CONS_EVT_PROF;

	return CONS_EVT_UNDEFINED;
}

/* -----------------------------------------------------------------------------
 * Exported/Public functions
 * -----------------------------------------------------------------------------
 */

int aiSystemPerformanceInit(void) {
	printf("\r\n#\r\n");
	printf("# %s %d.%d\r\n", _APP_NAME_, _APP_VERSION_MAJOR_,
	_APP_VERSION_MINOR_);
	printf("#\r\n");

#if defined(__GNUC__)
	printf("Compiled with GCC %d.%d.%d\r\n", __GNUC__, __GNUC_MINOR__,
	__GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
	printf("Compiled with IAR %d (build %d)\r\n", __IAR_SYSTEMS_ICC__,
			__BUILD_NUMBER__
	);
#elif defined (__CC_ARM)
	printf("Compiled with MDK-ARM Keil %d\r\n", __ARMCC_VERSION);
#endif

	dwtIpInit();
	crcIpInit();
	logDeviceConf();

	aiInit();

	srand(3); /* deterministic outcome */

	dwtReset();
	return 0;
}

