araobp/stm32-mcu/NUCLEO-F401RE/AI/AI_PERFORMANCE/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
int aiSystemPerformanceProcess(void) {
	int r;
	int idx = 0;

	do {
		r = aiTestPerformance(idx);
		idx = (idx + 1) % AI_MNETWORK_NUMBER;

		if (!r) {
			r = aiTestConsole();

			if (r == CONS_EVT_UNDEFINED) {
				r = 0;
			} else if (r == CONS_EVT_HELP) {
				printf("\r\n");
				printf("Possible key for the interactive console:\r\n");
				printf("  [q,Q]      quit the application\r\n");
				printf("  [r,R]      re-start (NN de-init and re-init)\r\n");
				printf("  [p,P]      pause\r\n");
				printf("  [h,H,?]    this information\r\n");
				printf("   xx        continue immediately\r\n");
				printf("\r\n");
				printf("Press any key to continue..\r\n");

				while ((r = aiTestConsole()) == CONS_EVT_TIMEOUT) {
					HAL_Delay(1000);
				}
				if (r == CONS_EVT_UNDEFINED)
					r = 0;
			}
			if (r == CONS_EVT_PROF) {
				profiling_mode = true;
				profiling_factor *= 2;
				r = 0;
			}

			if (r == CONS_EVT_RESTART) {
				profiling_mode = false;
				profiling_factor = 5;
				printf("\r\n");
				aiDeInit();
				aiSystemPerformanceInit();
				r = 0;
			}
			if (r == CONS_EVT_QUIT) {
				profiling_mode = false;
				printf("\r\n");
				disableInts();
				aiDeInit();
				printf("\r\n");
				printf("Board should be reseted...\r\n");
				while (1) {
					HAL_Delay(1000);
				}
			}
			if (r == CONS_EVT_PAUSE) {
				printf("\r\n");
				printf("Press any key to continue..\r\n");
				while ((r = aiTestConsole()) == CONS_EVT_TIMEOUT) {
					HAL_Delay(1000);
				}
				r = 0;
			}
		}
	} while (r == 0);

	return r;
}

void aiSystemPerformanceDeInit(void) {
	printf("\r\n");
	aiDeInit();
	printf("bye bye ...\r\n");
}

